# Задание 1
# import random
#
# list1 = ['волшебно', 'невероятно', 'восхитительно', 'божественно']
# list2 = ['красива', 'стройна', 'умна', 'пахнешь']
# n = random.choice(list1)
# n2 = random.choice(list2)
# print(f'Сегодня ты {n} {n2}!')

# Задание 2
# s = [x for x in range(10) if x > 3]
# print(s)
# s1 = [i for i in range(10, 0, -1) if i > 4]
# print(s1)

# Задание 3
# words = ["море", "солнце", "майка", "отпуск"]
# a_words = [i for i in words if i.startswith('м')]
# print(a_words)
#
# e_words = [n for n in words if n.endswith('е')]
# print(e_words)